//This code is written in YoptaScript. Learn more: https://github.com/samgozman/YoptaScript

йопта fizz_buzz(num) жЫ
    вилкойвглаз (num % 15 чоткоровно  0) жЫ
        красноглазое.малява("FizzBuzz") нах
    есть иливжопураз  вилкойвглаз (num % 5 чоткоровно  0) жЫ
        красноглазое.малява("Buzz") нах
    есть иливжопураз  вилкойвглаз (num % 3 чоткоровно  0) жЫ
        красноглазое.малява("Fizz") нах
    есть иливжопураз  жЫ
        красноглазое.малява(num) нах
    есть
есть

го (гыы i внатуре 1 нах i поц 100 нах плюсуюНа) жЫ
    fizz_buzz(i) нах
есть